export const PostData: {
    title: string;
    date: string;
    summary: string;
    tags: string[];
}[] = [
        {
            title: "AI 웹개발 취업캠프 역량강화-SW심화 FE 8월 16일 과제",
            date: "2023-08-18",
            summary: "",
            tags: [
                "정보통신산업진흥원",
                "NIPA",
                "AI교육",
                "프로젝트",
                "유데미",
                "IT개발캠프",
                "개발자부트캠프",
                "프론트엔드",
                "백엔드",
                "AI웹개발취업캠프",
                "취업캠프",
                "개발취업캠프"
            ],
        },
        {
            title: "AI 웹개발 취업캠프 역량강화-SW심화 FE 8월 14일 과제",
            date: "2023-08-17",
            summary: "리액트 부트스트랩을 학습하고, 간단한 자기소개 페이지를 만들어봤다.",
            tags: [
                "정보통신산업진흥원",
                "NIPA",
                "AI교육",
                "프로젝트",
                "유데미",
                "IT개발캠프",
                "개발자부트캠프",
                "프론트엔드",
                "백엔드",
                "AI웹개발취업캠프",
                "취업캠프",
                "개발취업캠프"
            ],
        },
        {
            title: "AI 웹개발 취업캠프 Udemy 4주차 학습일지 [정보통신산업진흥원]",
            date: "2023-08-15",
            summary: "ES 2015문법, 동기&비동기, Promise 등 JS의 난해한 개념을 복습했다. JS Engine의 동작 방식을 정리하고 직관적으로 이해했다.",
            tags: [
                "정보통신산업진흥원",
                "NIPA",
                "AI교육",
                "프로젝트",
                "유데미",
                "IT개발캠프",
                "개발자부트캠프",
                "프론트엔드",
                "백엔드",
                "AI웹개발취업캠프",
                "취업캠프",
                "개발취업캠프"
            ],
        },
        {
            title: "AI 웹개발 취업캠프 역량강화-SW심화 FE 8월 10일 과제",
            date: "2023-08-14",
            summary: "할 일 목록 애플리케이션을 개발했다. CRUD 고려하며 개발했고, 로컬스토리지를 활용했다. styled-components 라이브러리를 활용하여 나만의 스타일을 가진 할 일 목록을 만들었다.",
            tags: [
                "정보통신산업진흥원",
                "NIPA",
                "AI교육",
                "프로젝트",
                "유데미",
                "IT개발캠프",
                "개발자부트캠프",
                "프론트엔드",
                "백엔드",
                "AI웹개발취업캠프",
                "취업캠프",
                "개발취업캠프"
            ],
        },
        {
            title: "AI 웹개발 취업캠프 역량강화-SW심화 FE 8월 9일 과제",
            date: "2023-08-14",
            summary: "CSS의 애니메이션과 React의 라이브러리인 styled-components에 대해 학습하고 실습을 진행했다. 실습한 애플리케이션을 Netlify를 통해 배포했다.",
            tags: [
                "정보통신산업진흥원",
                "NIPA",
                "AI교육",
                "프로젝트",
                "유데미",
                "IT개발캠프",
                "개발자부트캠프",
                "프론트엔드",
                "백엔드",
                "AI웹개발취업캠프",
                "취업캠프",
                "개발취업캠프"
            ],
        },
        {
            title: "AI 웹개발 취업캠프 역량강화-SW심화 FE 8월 8일 과제",
            date: "2023-08-13",
            summary: "본격적으로 리액트를 사용했다. 리액트 레이아웃의 특징, 컴포넌트 재사용성 등, 리액트의 장점을 학습했다. ```create-react-app```을 활용하여 로또 번호 추첨 프로그램 개발하며 실습했다.",
            tags: [
                "정보통신산업진흥원",
                "NIPA",
                "AI교육",
                "프로젝트",
                "유데미",
                "IT개발캠프",
                "개발자부트캠프",
                "프론트엔드",
                "백엔드",
                "AI웹개발취업캠프",
                "취업캠프",
                "개발취업캠프"
            ],
        },
        {
            title: "AI 웹개발 취업캠프 역량강화-SW심화 FE 8월 7일 과제",
            date: "2023-08-12",
            summary: "Node.js를 활용하여 로컬호스트 서버를 돌렸다.",
            tags: [
                "정보통신산업진흥원",
                "NIPA",
                "AI교육",
                "프로젝트",
                "유데미",
                "IT개발캠프",
                "개발자부트캠프",
                "프론트엔드",
                "백엔드",
                "AI웹개발취업캠프",
                "취업캠프",
                "개발취업캠프"
            ],
        },
        {
            title: "AI 웹개발 취업캠프 Udemy 3주차 학습일지 [정보통신산업진흥원]",
            date: "2023-08-11",
            summary: "파이썬의 독특한 문법에 대해 학습했다. C 계열 문법과 달라서 어색하고 익숙해지기 어렵다.",
            tags: [
                "정보통신산업진흥원",
                "NIPA",
                "AI교육",
                "프로젝트",
                "유데미",
                "IT개발캠프",
                "개발자부트캠프",
                "프론트엔드",
                "백엔드",
                "AI웹개발취업캠프",
                "취업캠프",
                "개발취업캠프"
            ],
        },
    ]