export const PostData: {
    title: string;
    date: string;
    summary: string;
    tags: string[];
}[] = [

        {
            title: "AI 웹개발 취업캠프 역량강화-SW심화 FE 8월 7일 과제",
            date: "2023-08-12",
            summary: "Node.js를 활용하여 로컬호스트 서버를 돌렸다.",
            tags: [
                "정보통신산업진흥원",
                "NIPA",
                "AI교육",
                "프로젝트",
                "유데미",
                "IT개발캠프",
                "개발자부트캠프",
                "프론트엔드",
                "백엔드",
                "AI웹개발취업캠프",
                "취업캠프",
                "개발취업캠프"
            ],
        },
        {
            title: "AI 웹개발 취업캠프 Udemy 3주차 학습일지 [정보통신산업진흥원]",
            date: "2023-08-11",
            summary: "파이썬의 독특한 문법에 대해 학습했다. C 계열 문법과 달라서 어색하고 익숙해지기 어렵다.",
            tags: [
                "정보통신산업진흥원",
                "NIPA",
                "AI교육",
                "프로젝트",
                "유데미",
                "IT개발캠프",
                "개발자부트캠프",
                "프론트엔드",
                "백엔드",
                "AI웹개발취업캠프",
                "취업캠프",
                "개발취업캠프"
            ],
        },
    ]